run/Fogo/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

x_min  1920;
x_max  6400; 
y_min  890;
y_max  6490;
z_min  20;
z_max  2900;


vertices
(
    ( $x_min  $y_min  $z_min ) // 0  
    ( $x_max  $y_min  $z_min ) // 1  
    ( $x_max  $y_max  $z_min ) // 2  
    ( $x_min  $y_max  $z_min ) // 3
    ( $x_min  $y_min  $z_max ) // 4
    ( $x_max  $y_min  $z_max ) // 5
    ( $x_max  $y_max  $z_max ) // 6
    ( $x_min  $y_max  $z_max ) // 7
);

/* EB: in this case (x,y) forms the horizontal plane while
   the z-axis is oriented against the gravitational force */
blocks
(
    hex (0 1 2 3 4 5 6 7) (28 35 18) simpleGrading (1 1 1) // 160
/* EB: 
   (0;1) gives the direction of the x-axis
   (1;2) gives the direction of the y-axis */
 )   
edges
(
);

boundary
(
    lowerWall
    {
        type wall;
        faces
	  (
            (0 3 2 1) // EB: clockwise order seen from the hex inside 
      );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (0 4 7 3) //<--
            (0 1 5 4)//<--
            (1 2 6 5)
            (4 5 6 7) 
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
