run/Fogo/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libtdepGiordano.so"
); 

application     interThermalRadConvFoam;

startFrom       startTime; //latestTime;

startTime       0;

stopAt          endTime;

endTime         86400;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   60;

purgeWrite      0;

writeFormat     ascii; //binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;//2;
maxAlphaCo      1;

maxDeltaT       1;

// ************************************************************************* //
